app/views/locations/index.html.erb

SELECT  "reports".* FROM "reports" WHERE "reports"."user_id" = ? ORDER BY "reports"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "locations".* FROM "locations"
---

<% usrLoc = (params[:usrLoc] ? params[:usrLoc] : current_user ? current_user.reports.first.location : "Bear Hill Preserve") %>